app/controllers/movies_controller.rb

    def index
      @movies = Movie.all
      @all_ratings = Movie.all_ratings
      @title_header = ''
      @release_date_header = ''

      @ratings_to_show = []
      ratings_to_check = params.keys
      if ratings_to_check.include?(:ratings)
        @ratings_to_show = params[:ratings].keys
        @ratings_selected = get_ratings_selected(@ratings_to_show) # changed this from @ratings_to_show_hash
      end

      @movies = Movie.with_ratings(@ratings_to_show)

      sort_by_action = params[:sort_by]
      if !sort_by_action.nil?
        @movies = @movies.order(sort_by_action)
---
SELECT "movies".* FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')